ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/eindkomst/iosh/ValidRequest_existingCPR_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2008/01/01/">
	<soapenv:Header/>
	<soapenv:Body>
		<ns:IndkomstOplysningSumHent_I>
			<ns:Kontekst>
				<!--You may enter ANY elements at this point-->
			</ns:Kontekst>
			<ns:IndkomstOplysningSumInddata>
				<ns:AbonnentAdgangStruktur>
					<ns:AbonnentTypeKode>2166</ns:AbonnentTypeKode>
					<ns:AbonnementTypeKode>3189</ns:AbonnementTypeKode>
					<ns:AdgangFormålTypeKode>564</ns:AdgangFormålTypeKode>
				</ns:AbonnentAdgangStruktur>
				<ns:AbonnentStruktur>
					<ns:AbonnentVirksomhedStruktur>
						<ns:AbonnentVirksomhed>
							<ns:VirksomhedSENummer>19552101</ns:VirksomhedSENummer>
						</ns:AbonnentVirksomhed>
					</ns:AbonnentVirksomhedStruktur>
					<!--Optional:-->
					<ns:IndkomstOplysningAdgangMedarbejderIdentifikation>?</ns:IndkomstOplysningAdgangMedarbejderIdentifikation>
				</ns:AbonnentStruktur>
				<ns:IndkomstOplysningValg>
					<!--You have a CHOICE of the next 2 items at this level-->
					<ns:IndkomstPersonSamling>
						<!--1 or more repetitions:-->
						<ns:PersonIndkomstSumSøgeStruktur>
							<ns:PersonCPRNummer>1909580060</ns:PersonCPRNummer>
							<!--Optional:-->
							<ns:IndkomstOplysningAdgangReferenceNummer>KOA SKAT XML IOSUH</ns:IndkomstOplysningAdgangReferenceNummer>
							<ns:SøgeÅrMånedLukketStruktur>
								<ns:SøgeÅrMånedFra>200801</ns:SøgeÅrMånedFra>
								<ns:SøgeÅrMånedTil>201705</ns:SøgeÅrMånedTil>
							</ns:SøgeÅrMånedLukketStruktur>
						</ns:PersonIndkomstSumSøgeStruktur>
					</ns:IndkomstPersonSamling>
				</ns:IndkomstOplysningValg>
			</ns:IndkomstOplysningSumInddata>
		</ns:IndkomstOplysningSumHent_I>
	</soapenv:Body>
</soapenv:Envelope>